MikroElektronika/core_packages/PIC/XC8/def/PIC16F753/mcu.h
// Register: SLPC1CON0
#define SLPC1CON0 SLPC1CON0
extern volatile unsigned char           SLPC1CON0           __at(0x11E);
#ifndef _LIB_BUILD
asm("SLPC1CON0 equ 011Eh");
#endif
// aliases
extern volatile unsigned char           SLPCCON0            __at(0x11E);
#ifndef _LIB_BUILD
asm("SLPCCON0 equ 011Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SC1INS                 :1;
        unsigned                        :1;
        unsigned SC1TSS                 :2;
        unsigned SC1POL                 :1;
        unsigned SC1MRPE                :1;
        unsigned                        :1;
        unsigned SC1EN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned SCS1TSS0               :1;
        unsigned SCS1TSS1               :1;
    };
} SLPC1CON0bits_t;
extern volatile SLPC1CON0bits_t SLPC1CON0bits __at(0x11E);
// bitfield macros
#define _SLPC1CON0_SC1INS_POSN                              0x0
#define _SLPC1CON0_SC1INS_POSITION                          0x0
#define _SLPC1CON0_SC1INS_SIZE                              0x1
#define _SLPC1CON0_SC1INS_LENGTH                            0x1
#define _SLPC1CON0_SC1INS_MASK                              0x1
#define _SLPC1CON0_SC1TSS_POSN                              0x2
#define _SLPC1CON0_SC1TSS_POSITION                          0x2
#define _SLPC1CON0_SC1TSS_SIZE                              0x2
#define _SLPC1CON0_SC1TSS_LENGTH                            0x2
#define _SLPC1CON0_SC1TSS_MASK                              0xC
#define _SLPC1CON0_SC1POL_POSN                              0x4
#define _SLPC1CON0_SC1POL_POSITION                          0x4
#define _SLPC1CON0_SC1POL_SIZE                              0x1
#define _SLPC1CON0_SC1POL_LENGTH                            0x1
#define _SLPC1CON0_SC1POL_MASK                              0x10
#define _SLPC1CON0_SC1MRPE_POSN                             0x5
#define _SLPC1CON0_SC1MRPE_POSITION                         0x5
#define _SLPC1CON0_SC1MRPE_SIZE                             0x1
#define _SLPC1CON0_SC1MRPE_LENGTH                           0x1
#define _SLPC1CON0_SC1MRPE_MASK                             0x20
#define _SLPC1CON0_SC1EN_POSN                               0x7
#define _SLPC1CON0_SC1EN_POSITION                           0x7
#define _SLPC1CON0_SC1EN_SIZE                               0x1
#define _SLPC1CON0_SC1EN_LENGTH                             0x1
#define _SLPC1CON0_SC1EN_MASK                               0x80
#define _SLPC1CON0_SCS1TSS0_POSN                            0x2
#define _SLPC1CON0_SCS1TSS0_POSITION                        0x2
#define _SLPC1CON0_SCS1TSS0_SIZE                            0x1
#define _SLPC1CON0_SCS1TSS0_LENGTH                          0x1
#define _SLPC1CON0_SCS1TSS0_MASK                            0x4
#define _SLPC1CON0_SCS1TSS1_POSN                            0x3
#define _SLPC1CON0_SCS1TSS1_POSITION                        0x3
#define _SLPC1CON0_SCS1TSS1_SIZE                            0x1
#define _SLPC1CON0_SCS1TSS1_LENGTH                          0x1
#define _SLPC1CON0_SCS1TSS1_MASK                            0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned SC1INS                 :1;
        unsigned                        :1;
        unsigned SC1TSS                 :2;
        unsigned SC1POL                 :1;
        unsigned SC1MRPE                :1;
        unsigned                        :1;
        unsigned SC1EN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned SCS1TSS0               :1;
        unsigned SCS1TSS1               :1;
    };
} SLPCCON0bits_t;
extern volatile SLPCCON0bits_t SLPCCON0bits __at(0x11E);
// bitfield macros
#define _SLPCCON0_SC1INS_POSN                               0x0
#define _SLPCCON0_SC1INS_POSITION                           0x0
#define _SLPCCON0_SC1INS_SIZE                               0x1
#define _SLPCCON0_SC1INS_LENGTH                             0x1
#define _SLPCCON0_SC1INS_MASK                               0x1
#define _SLPCCON0_SC1TSS_POSN                               0x2
#define _SLPCCON0_SC1TSS_POSITION                           0x2
#define _SLPCCON0_SC1TSS_SIZE                               0x2
#define _SLPCCON0_SC1TSS_LENGTH                             0x2
#define _SLPCCON0_SC1TSS_MASK                               0xC
#define _SLPCCON0_SC1POL_POSN                               0x4
#define _SLPCCON0_SC1POL_POSITION                           0x4
#define _SLPCCON0_SC1POL_SIZE                               0x1
#define _SLPCCON0_SC1POL_LENGTH                             0x1
#define _SLPCCON0_SC1POL_MASK                               0x10
#define _SLPCCON0_SC1MRPE_POSN                              0x5
#define _SLPCCON0_SC1MRPE_POSITION                          0x5
#define _SLPCCON0_SC1MRPE_SIZE                              0x1
#define _SLPCCON0_SC1MRPE_LENGTH                            0x1
#define _SLPCCON0_SC1MRPE_MASK                              0x20
#define _SLPCCON0_SC1EN_POSN                                0x7
#define _SLPCCON0_SC1EN_POSITION                            0x7
#define _SLPCCON0_SC1EN_SIZE                                0x1
#define _SLPCCON0_SC1EN_LENGTH                              0x1
#define _SLPCCON0_SC1EN_MASK                                0x80
#define _SLPCCON0_SCS1TSS0_POSN                             0x2
#define _SLPCCON0_SCS1TSS0_POSITION                         0x2
#define _SLPCCON0_SCS1TSS0_SIZE                             0x1
#define _SLPCCON0_SCS1TSS0_LENGTH                           0x1
#define _SLPCCON0_SCS1TSS0_MASK                             0x4
#define _SLPCCON0_SCS1TSS1_POSN                             0x3
#define _SLPCCON0_SCS1TSS1_POSITION                         0x3
#define _SLPCCON0_SCS1TSS1_SIZE                             0x1
#define _SLPCCON0_SCS1TSS1_LENGTH                           0x1
#define _SLPCCON0_SCS1TSS1_MASK                             0x8

// Register: SLPC1CON1
#define SLPC1CON1 SLPC1CON1
extern volatile unsigned char           SLPC1CON1           __at(0x11F);
#ifndef _LIB_BUILD
asm("SLPC1CON1 equ 011Fh");
#endif
// aliases
extern volatile unsigned char           SLPCCON1            __at(0x11F);
#ifndef _LIB_BUILD
asm("SLPCCON1 equ 011Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SC1ISET                :4;
        unsigned SC1RNG                 :1;
    };
    struct {
        unsigned SC1ISET0               :1;
        unsigned SC1ISET1               :1;
        unsigned SC1ISET2               :1;
        unsigned SC1ISET3               :1;
    };
} SLPC1CON1bits_t;
