MikroElektronika/core_packages/PIC/XC8/def/PIC16F753/mcu.h
extern volatile SLPC1CON1bits_t SLPC1CON1bits __at(0x11F);
// bitfield macros
#define _SLPC1CON1_SC1ISET_POSN                             0x0
#define _SLPC1CON1_SC1ISET_POSITION                         0x0
#define _SLPC1CON1_SC1ISET_SIZE                             0x4
#define _SLPC1CON1_SC1ISET_LENGTH                           0x4
#define _SLPC1CON1_SC1ISET_MASK                             0xF
#define _SLPC1CON1_SC1RNG_POSN                              0x4
#define _SLPC1CON1_SC1RNG_POSITION                          0x4
#define _SLPC1CON1_SC1RNG_SIZE                              0x1
#define _SLPC1CON1_SC1RNG_LENGTH                            0x1
#define _SLPC1CON1_SC1RNG_MASK                              0x10
#define _SLPC1CON1_SC1ISET0_POSN                            0x0
#define _SLPC1CON1_SC1ISET0_POSITION                        0x0
#define _SLPC1CON1_SC1ISET0_SIZE                            0x1
#define _SLPC1CON1_SC1ISET0_LENGTH                          0x1
#define _SLPC1CON1_SC1ISET0_MASK                            0x1
#define _SLPC1CON1_SC1ISET1_POSN                            0x1
#define _SLPC1CON1_SC1ISET1_POSITION                        0x1
#define _SLPC1CON1_SC1ISET1_SIZE                            0x1
#define _SLPC1CON1_SC1ISET1_LENGTH                          0x1
#define _SLPC1CON1_SC1ISET1_MASK                            0x2
#define _SLPC1CON1_SC1ISET2_POSN                            0x2
#define _SLPC1CON1_SC1ISET2_POSITION                        0x2
#define _SLPC1CON1_SC1ISET2_SIZE                            0x1
#define _SLPC1CON1_SC1ISET2_LENGTH                          0x1
#define _SLPC1CON1_SC1ISET2_MASK                            0x4
#define _SLPC1CON1_SC1ISET3_POSN                            0x3
#define _SLPC1CON1_SC1ISET3_POSITION                        0x3
#define _SLPC1CON1_SC1ISET3_SIZE                            0x1
#define _SLPC1CON1_SC1ISET3_LENGTH                          0x1
#define _SLPC1CON1_SC1ISET3_MASK                            0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned SC1ISET                :4;
        unsigned SC1RNG                 :1;
    };
    struct {
        unsigned SC1ISET0               :1;
        unsigned SC1ISET1               :1;
        unsigned SC1ISET2               :1;
        unsigned SC1ISET3               :1;
    };
} SLPCCON1bits_t;
extern volatile SLPCCON1bits_t SLPCCON1bits __at(0x11F);
// bitfield macros
#define _SLPCCON1_SC1ISET_POSN                              0x0
#define _SLPCCON1_SC1ISET_POSITION                          0x0
#define _SLPCCON1_SC1ISET_SIZE                              0x4
#define _SLPCCON1_SC1ISET_LENGTH                            0x4
#define _SLPCCON1_SC1ISET_MASK                              0xF
#define _SLPCCON1_SC1RNG_POSN                               0x4
#define _SLPCCON1_SC1RNG_POSITION                           0x4
#define _SLPCCON1_SC1RNG_SIZE                               0x1
#define _SLPCCON1_SC1RNG_LENGTH                             0x1
#define _SLPCCON1_SC1RNG_MASK                               0x10
#define _SLPCCON1_SC1ISET0_POSN                             0x0
#define _SLPCCON1_SC1ISET0_POSITION                         0x0
#define _SLPCCON1_SC1ISET0_SIZE                             0x1
#define _SLPCCON1_SC1ISET0_LENGTH                           0x1
#define _SLPCCON1_SC1ISET0_MASK                             0x1
#define _SLPCCON1_SC1ISET1_POSN                             0x1
#define _SLPCCON1_SC1ISET1_POSITION                         0x1
#define _SLPCCON1_SC1ISET1_SIZE                             0x1
#define _SLPCCON1_SC1ISET1_LENGTH                           0x1
#define _SLPCCON1_SC1ISET1_MASK                             0x2
#define _SLPCCON1_SC1ISET2_POSN                             0x2
#define _SLPCCON1_SC1ISET2_POSITION                         0x2
#define _SLPCCON1_SC1ISET2_SIZE                             0x1
#define _SLPCCON1_SC1ISET2_LENGTH                           0x1
#define _SLPCCON1_SC1ISET2_MASK                             0x4
#define _SLPCCON1_SC1ISET3_POSN                             0x3
#define _SLPCCON1_SC1ISET3_POSITION                         0x3
#define _SLPCCON1_SC1ISET3_SIZE                             0x1
#define _SLPCCON1_SC1ISET3_LENGTH                           0x1
#define _SLPCCON1_SC1ISET3_MASK                             0x8

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x185);
#ifndef _LIB_BUILD
asm("ANSELA equ 0185h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned                        :1;
        unsigned ANSA4                  :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x185);
// bitfield macros
#define _ANSELA_ANSA0_POSN                                  0x0
#define _ANSELA_ANSA0_POSITION                              0x0
#define _ANSELA_ANSA0_SIZE                                  0x1
#define _ANSELA_ANSA0_LENGTH                                0x1
#define _ANSELA_ANSA0_MASK                                  0x1
#define _ANSELA_ANSA1_POSN                                  0x1
#define _ANSELA_ANSA1_POSITION                              0x1
#define _ANSELA_ANSA1_SIZE                                  0x1
#define _ANSELA_ANSA1_LENGTH                                0x1
#define _ANSELA_ANSA1_MASK                                  0x2
#define _ANSELA_ANSA2_POSN                                  0x2
#define _ANSELA_ANSA2_POSITION                              0x2
#define _ANSELA_ANSA2_SIZE                                  0x1
#define _ANSELA_ANSA2_LENGTH                                0x1
#define _ANSELA_ANSA2_MASK                                  0x4
#define _ANSELA_ANSA4_POSN                                  0x4
#define _ANSELA_ANSA4_POSITION                              0x4
#define _ANSELA_ANSA4_SIZE                                  0x1
#define _ANSELA_ANSA4_LENGTH                                0x1
#define _ANSELA_ANSA4_MASK                                  0x10

// Register: ANSELC
#define ANSELC ANSELC
extern volatile unsigned char           ANSELC              __at(0x187);
#ifndef _LIB_BUILD
asm("ANSELC equ 0187h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSC0                  :1;
        unsigned ANSC1                  :1;
        unsigned ANSC2                  :1;
        unsigned ANSC3                  :1;
    };
} ANSELCbits_t;
extern volatile ANSELCbits_t ANSELCbits __at(0x187);
// bitfield macros
#define _ANSELC_ANSC0_POSN                                  0x0
#define _ANSELC_ANSC0_POSITION                              0x0
#define _ANSELC_ANSC0_SIZE                                  0x1
#define _ANSELC_ANSC0_LENGTH                                0x1
#define _ANSELC_ANSC0_MASK                                  0x1
#define _ANSELC_ANSC1_POSN                                  0x1
#define _ANSELC_ANSC1_POSITION                              0x1
#define _ANSELC_ANSC1_SIZE                                  0x1
#define _ANSELC_ANSC1_LENGTH                                0x1
#define _ANSELC_ANSC1_MASK                                  0x2
#define _ANSELC_ANSC2_POSN                                  0x2
#define _ANSELC_ANSC2_POSITION                              0x2
#define _ANSELC_ANSC2_SIZE                                  0x1
#define _ANSELC_ANSC2_LENGTH                                0x1
#define _ANSELC_ANSC2_MASK                                  0x4
#define _ANSELC_ANSC3_POSN                                  0x3
#define _ANSELC_ANSC3_POSITION                              0x3
#define _ANSELC_ANSC3_SIZE                                  0x1
#define _ANSELC_ANSC3_LENGTH                                0x1
#define _ANSELC_ANSC3_MASK                                  0x8

// Register: APFCON
#define APFCON APFCON
extern volatile unsigned char           APFCON              __at(0x188);
#ifndef _LIB_BUILD
asm("APFCON equ 0188h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned T1GSEL                 :1;
    };
} APFCONbits_t;
