MikroElektronika/core_packages/PIC/XC8/def/PIC16F753/mcu.h
extern volatile COG1FSIMbits_t COG1FSIMbits __at(0x19D);
// bitfield macros
#define _COG1FSIM_G1FMC1_POSN                               0x0
#define _COG1FSIM_G1FMC1_POSITION                           0x0
#define _COG1FSIM_G1FMC1_SIZE                               0x1
#define _COG1FSIM_G1FMC1_LENGTH                             0x1
#define _COG1FSIM_G1FMC1_MASK                               0x1
#define _COG1FSIM_G1FMC2_POSN                               0x1
#define _COG1FSIM_G1FMC2_POSITION                           0x1
#define _COG1FSIM_G1FMC2_SIZE                               0x1
#define _COG1FSIM_G1FMC2_LENGTH                             0x1
#define _COG1FSIM_G1FMC2_MASK                               0x2
#define _COG1FSIM_G1FMCCP1_POSN                             0x2
#define _COG1FSIM_G1FMCCP1_POSITION                         0x2
#define _COG1FSIM_G1FMCCP1_SIZE                             0x1
#define _COG1FSIM_G1FMCCP1_LENGTH                           0x1
#define _COG1FSIM_G1FMCCP1_MASK                             0x4
#define _COG1FSIM_G1FMFLT_POSN                              0x3
#define _COG1FSIM_G1FMFLT_POSITION                          0x3
#define _COG1FSIM_G1FMFLT_SIZE                              0x1
#define _COG1FSIM_G1FMFLT_LENGTH                            0x1
#define _COG1FSIM_G1FMFLT_MASK                              0x8
#define _COG1FSIM_G1FMT2M_POSN                              0x4
#define _COG1FSIM_G1FMT2M_POSITION                          0x4
#define _COG1FSIM_G1FMT2M_SIZE                              0x1
#define _COG1FSIM_G1FMT2M_LENGTH                            0x1
#define _COG1FSIM_G1FMT2M_MASK                              0x10
#define _COG1FSIM_G1FMHLT1_POSN                             0x5
#define _COG1FSIM_G1FMHLT1_POSITION                         0x5
#define _COG1FSIM_G1FMHLT1_SIZE                             0x1
#define _COG1FSIM_G1FMHLT1_LENGTH                           0x1
#define _COG1FSIM_G1FMHLT1_MASK                             0x20
#define _COG1FSIM_G1FMHLT2_POSN                             0x6
#define _COG1FSIM_G1FMHLT2_POSITION                         0x6
#define _COG1FSIM_G1FMHLT2_SIZE                             0x1
#define _COG1FSIM_G1FMHLT2_LENGTH                           0x1
#define _COG1FSIM_G1FMHLT2_MASK                             0x40

// Register: COG1ASD0
#define COG1ASD0 COG1ASD0
extern volatile unsigned char           COG1ASD0            __at(0x19E);
#ifndef _LIB_BUILD
asm("COG1ASD0 equ 019Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned G1ASD0L                :2;
        unsigned G1ASD1L                :2;
        unsigned G1ARSEN                :1;
        unsigned G1ASDE                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned G1ASD0L0               :1;
        unsigned G1ASD0L1               :1;
        unsigned G1ASD1L0               :1;
        unsigned G1ASD1L1               :1;
    };
} COG1ASD0bits_t;
extern volatile COG1ASD0bits_t COG1ASD0bits __at(0x19E);
// bitfield macros
#define _COG1ASD0_G1ASD0L_POSN                              0x2
#define _COG1ASD0_G1ASD0L_POSITION                          0x2
#define _COG1ASD0_G1ASD0L_SIZE                              0x2
#define _COG1ASD0_G1ASD0L_LENGTH                            0x2
#define _COG1ASD0_G1ASD0L_MASK                              0xC
#define _COG1ASD0_G1ASD1L_POSN                              0x4
#define _COG1ASD0_G1ASD1L_POSITION                          0x4
#define _COG1ASD0_G1ASD1L_SIZE                              0x2
#define _COG1ASD0_G1ASD1L_LENGTH                            0x2
#define _COG1ASD0_G1ASD1L_MASK                              0x30
#define _COG1ASD0_G1ARSEN_POSN                              0x6
#define _COG1ASD0_G1ARSEN_POSITION                          0x6
#define _COG1ASD0_G1ARSEN_SIZE                              0x1
#define _COG1ASD0_G1ARSEN_LENGTH                            0x1
#define _COG1ASD0_G1ARSEN_MASK                              0x40
#define _COG1ASD0_G1ASDE_POSN                               0x7
#define _COG1ASD0_G1ASDE_POSITION                           0x7
#define _COG1ASD0_G1ASDE_SIZE                               0x1
#define _COG1ASD0_G1ASDE_LENGTH                             0x1
#define _COG1ASD0_G1ASDE_MASK                               0x80
#define _COG1ASD0_G1ASD0L0_POSN                             0x2
#define _COG1ASD0_G1ASD0L0_POSITION                         0x2
#define _COG1ASD0_G1ASD0L0_SIZE                             0x1
#define _COG1ASD0_G1ASD0L0_LENGTH                           0x1
#define _COG1ASD0_G1ASD0L0_MASK                             0x4
#define _COG1ASD0_G1ASD0L1_POSN                             0x3
#define _COG1ASD0_G1ASD0L1_POSITION                         0x3
#define _COG1ASD0_G1ASD0L1_SIZE                             0x1
#define _COG1ASD0_G1ASD0L1_LENGTH                           0x1
#define _COG1ASD0_G1ASD0L1_MASK                             0x8
#define _COG1ASD0_G1ASD1L0_POSN                             0x4
#define _COG1ASD0_G1ASD1L0_POSITION                         0x4
#define _COG1ASD0_G1ASD1L0_SIZE                             0x1
#define _COG1ASD0_G1ASD1L0_LENGTH                           0x1
#define _COG1ASD0_G1ASD1L0_MASK                             0x10
#define _COG1ASD0_G1ASD1L1_POSN                             0x5
#define _COG1ASD0_G1ASD1L1_POSITION                         0x5
#define _COG1ASD0_G1ASD1L1_SIZE                             0x1
#define _COG1ASD0_G1ASD1L1_LENGTH                           0x1
#define _COG1ASD0_G1ASD1L1_MASK                             0x20

// Register: COG1ASD1
#define COG1ASD1 COG1ASD1
extern volatile unsigned char           COG1ASD1            __at(0x19F);
#ifndef _LIB_BUILD
asm("COG1ASD1 equ 019Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1ASDSFLT              :1;
        unsigned G1ASDSC1               :1;
        unsigned G1ASDSC2               :1;
        unsigned G1ASDSHLT1             :1;
        unsigned G1ASDSHLT2             :1;
    };
} COG1ASD1bits_t;
extern volatile COG1ASD1bits_t COG1ASD1bits __at(0x19F);
// bitfield macros
#define _COG1ASD1_G1ASDSFLT_POSN                            0x0
#define _COG1ASD1_G1ASDSFLT_POSITION                        0x0
#define _COG1ASD1_G1ASDSFLT_SIZE                            0x1
#define _COG1ASD1_G1ASDSFLT_LENGTH                          0x1
#define _COG1ASD1_G1ASDSFLT_MASK                            0x1
#define _COG1ASD1_G1ASDSC1_POSN                             0x1
#define _COG1ASD1_G1ASDSC1_POSITION                         0x1
#define _COG1ASD1_G1ASDSC1_SIZE                             0x1
#define _COG1ASD1_G1ASDSC1_LENGTH                           0x1
#define _COG1ASD1_G1ASDSC1_MASK                             0x2
#define _COG1ASD1_G1ASDSC2_POSN                             0x2
#define _COG1ASD1_G1ASDSC2_POSITION                         0x2
#define _COG1ASD1_G1ASDSC2_SIZE                             0x1
#define _COG1ASD1_G1ASDSC2_LENGTH                           0x1
#define _COG1ASD1_G1ASDSC2_MASK                             0x4
#define _COG1ASD1_G1ASDSHLT1_POSN                           0x3
#define _COG1ASD1_G1ASDSHLT1_POSITION                       0x3
#define _COG1ASD1_G1ASDSHLT1_SIZE                           0x1
#define _COG1ASD1_G1ASDSHLT1_LENGTH                         0x1
#define _COG1ASD1_G1ASDSHLT1_MASK                           0x8
#define _COG1ASD1_G1ASDSHLT2_POSN                           0x4
#define _COG1ASD1_G1ASDSHLT2_POSITION                       0x4
#define _COG1ASD1_G1ASDSHLT2_SIZE                           0x1
#define _COG1ASD1_G1ASDSHLT2_LENGTH                         0x1
#define _COG1ASD1_G1ASDSHLT2_MASK                           0x10

