MikroElektronika/core_packages/PIC/XC8/def/PIC16F753/mcu.h
#define                                 G1FMFLT_bit         _BIT_ACCESS(COG1FSIM,3)
// COG1FSIM<G1FMHLT1>
extern volatile __bit                   G1FMHLT1            __at(0xCED);	// @ (0x19D * 8 + 5)
#define                                 G1FMHLT1_bit        _BIT_ACCESS(COG1FSIM,5)
// COG1FSIM<G1FMHLT2>
extern volatile __bit                   G1FMHLT2            __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 G1FMHLT2_bit        _BIT_ACCESS(COG1FSIM,6)
// COG1FSIM<G1FMT2M>
extern volatile __bit                   G1FMT2M             __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 G1FMT2M_bit         _BIT_ACCESS(COG1FSIM,4)
// COG1CON0<G1LD>
extern volatile __bit                   G1LD                __at(0xCC2);	// @ (0x198 * 8 + 2)
#define                                 G1LD_bit            _BIT_ACCESS(COG1CON0,2)
// COG1CON0<G1MD>
extern volatile __bit                   G1MD                __at(0xCC0);	// @ (0x198 * 8 + 0)
#define                                 G1MD_bit            _BIT_ACCESS(COG1CON0,0)
// COG1CON0<G1OE0>
extern volatile __bit                   G1OE0               __at(0xCC5);	// @ (0x198 * 8 + 5)
#define                                 G1OE0_bit           _BIT_ACCESS(COG1CON0,5)
// COG1CON0<G1OE1>
extern volatile __bit                   G1OE1               __at(0xCC6);	// @ (0x198 * 8 + 6)
#define                                 G1OE1_bit           _BIT_ACCESS(COG1CON0,6)
// COG1PHF<G1PHF0>
extern volatile __bit                   G1PHF0              __at(0xC98);	// @ (0x193 * 8 + 0)
#define                                 G1PHF0_bit          _BIT_ACCESS(COG1PHF,0)
// COG1PHF<G1PHF1>
extern volatile __bit                   G1PHF1              __at(0xC99);	// @ (0x193 * 8 + 1)
#define                                 G1PHF1_bit          _BIT_ACCESS(COG1PHF,1)
// COG1PHF<G1PHF2>
extern volatile __bit                   G1PHF2              __at(0xC9A);	// @ (0x193 * 8 + 2)
#define                                 G1PHF2_bit          _BIT_ACCESS(COG1PHF,2)
// COG1PHF<G1PHF3>
extern volatile __bit                   G1PHF3              __at(0xC9B);	// @ (0x193 * 8 + 3)
#define                                 G1PHF3_bit          _BIT_ACCESS(COG1PHF,3)
// COG1PHR<G1PHR0>
extern volatile __bit                   G1PHR0              __at(0xC90);	// @ (0x192 * 8 + 0)
#define                                 G1PHR0_bit          _BIT_ACCESS(COG1PHR,0)
// COG1PHR<G1PHR1>
extern volatile __bit                   G1PHR1              __at(0xC91);	// @ (0x192 * 8 + 1)
#define                                 G1PHR1_bit          _BIT_ACCESS(COG1PHR,1)
// COG1PHR<G1PHR2>
extern volatile __bit                   G1PHR2              __at(0xC92);	// @ (0x192 * 8 + 2)
#define                                 G1PHR2_bit          _BIT_ACCESS(COG1PHR,2)
// COG1PHR<G1PHR3>
extern volatile __bit                   G1PHR3              __at(0xC93);	// @ (0x192 * 8 + 3)
#define                                 G1PHR3_bit          _BIT_ACCESS(COG1PHR,3)
// COG1CON0<G1POL0>
extern volatile __bit                   G1POL0              __at(0xCC3);	// @ (0x198 * 8 + 3)
#define                                 G1POL0_bit          _BIT_ACCESS(COG1CON0,3)
// COG1CON0<G1POL1>
extern volatile __bit                   G1POL1              __at(0xCC4);	// @ (0x198 * 8 + 4)
#define                                 G1POL1_bit          _BIT_ACCESS(COG1CON0,4)
// COG1RIS<G1R1HLT1>
extern volatile __bit                   G1R1HLT1            __at(0xCD5);	// @ (0x19A * 8 + 5)
#define                                 G1R1HLT1_bit        _BIT_ACCESS(COG1RIS,5)
// COG1CON1<G1RDBTS>
extern volatile __bit                   G1RDBTS             __at(0xCCF);	// @ (0x199 * 8 + 7)
#define                                 G1RDBTS_bit         _BIT_ACCESS(COG1CON1,7)
// COG1RIS<G1RIC1>
extern volatile __bit                   G1RIC1              __at(0xCD0);	// @ (0x19A * 8 + 0)
#define                                 G1RIC1_bit          _BIT_ACCESS(COG1RIS,0)
// COG1RIS<G1RIC2>
extern volatile __bit                   G1RIC2              __at(0xCD1);	// @ (0x19A * 8 + 1)
#define                                 G1RIC2_bit          _BIT_ACCESS(COG1RIS,1)
// COG1RIS<G1RIFLT>
extern volatile __bit                   G1RIFLT             __at(0xCD3);	// @ (0x19A * 8 + 3)
#define                                 G1RIFLT_bit         _BIT_ACCESS(COG1RIS,3)
// COG1RIS<G1RIHLT2>
extern volatile __bit                   G1RIHLT2            __at(0xCD6);	// @ (0x19A * 8 + 6)
#define                                 G1RIHLT2_bit        _BIT_ACCESS(COG1RIS,6)
// COG1RIS<G1RIT2M>
extern volatile __bit                   G1RIT2M             __at(0xCD4);	// @ (0x19A * 8 + 4)
#define                                 G1RIT2M_bit         _BIT_ACCESS(COG1RIS,4)
// COG1RSIM<G1RMC1>
extern volatile __bit                   G1RMC1              __at(0xCD8);	// @ (0x19B * 8 + 0)
#define                                 G1RMC1_bit          _BIT_ACCESS(COG1RSIM,0)
// COG1RSIM<G1RMC2>
extern volatile __bit                   G1RMC2              __at(0xCD9);	// @ (0x19B * 8 + 1)
#define                                 G1RMC2_bit          _BIT_ACCESS(COG1RSIM,1)
// COG1RSIM<G1RMCCP1>
extern volatile __bit                   G1RMCCP1            __at(0xCDA);	// @ (0x19B * 8 + 2)
#define                                 G1RMCCP1_bit        _BIT_ACCESS(COG1RSIM,2)
// COG1RSIM<G1RMFLT>
extern volatile __bit                   G1RMFLT             __at(0xCDB);	// @ (0x19B * 8 + 3)
#define                                 G1RMFLT_bit         _BIT_ACCESS(COG1RSIM,3)
// COG1RSIM<G1RMHLT1>
extern volatile __bit                   G1RMHLT1            __at(0xCDD);	// @ (0x19B * 8 + 5)
#define                                 G1RMHLT1_bit        _BIT_ACCESS(COG1RSIM,5)
// COG1RSIM<G1RMHLT2>
extern volatile __bit                   G1RMHLT2            __at(0xCDE);	// @ (0x19B * 8 + 6)
#define                                 G1RMHLT2_bit        _BIT_ACCESS(COG1RSIM,6)
// COG1RSIM<G1RTM2M>
extern volatile __bit                   G1RTM2M             __at(0xCDC);	// @ (0x19B * 8 + 4)
#define                                 G1RTM2M_bit         _BIT_ACCESS(COG1RSIM,4)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0xF1);	// @ (0x1E * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// HLT1CON0<H1CKPS0>
extern volatile __bit                   H1CKPS0             __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 H1CKPS0_bit         _BIT_ACCESS(HLT1CON0,0)
// HLT1CON0<H1CKPS1>
extern volatile __bit                   H1CKPS1             __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 H1CKPS1_bit         _BIT_ACCESS(HLT1CON0,1)
// HLT1CON1<H1ERS0>
extern volatile __bit                   H1ERS0              __at(0x8B2);	// @ (0x116 * 8 + 2)
#define                                 H1ERS0_bit          _BIT_ACCESS(HLT1CON1,2)
// HLT1CON1<H1ERS1>
extern volatile __bit                   H1ERS1              __at(0x8B3);	// @ (0x116 * 8 + 3)
#define                                 H1ERS1_bit          _BIT_ACCESS(HLT1CON1,3)
// HLT1CON1<H1ERS2>
extern volatile __bit                   H1ERS2              __at(0x8B4);	// @ (0x116 * 8 + 4)
#define                                 H1ERS2_bit          _BIT_ACCESS(HLT1CON1,4)
// HLT1CON1<H1FEREN>
extern volatile __bit                   H1FEREN             __at(0x8B1);	// @ (0x116 * 8 + 1)
#define                                 H1FEREN_bit         _BIT_ACCESS(HLT1CON1,1)
// HLT1CON1<H1FES>
extern volatile __bit                   H1FES               __at(0x8B7);	// @ (0x116 * 8 + 7)
#define                                 H1FES_bit           _BIT_ACCESS(HLT1CON1,7)
// HLT1CON0<H1ON>
extern volatile __bit                   H1ON                __at(0x8AA);	// @ (0x115 * 8 + 2)
#define                                 H1ON_bit            _BIT_ACCESS(HLT1CON0,2)
// HLT1CON0<H1OUTPS0>
extern volatile __bit                   H1OUTPS0            __at(0x8AB);	// @ (0x115 * 8 + 3)
#define                                 H1OUTPS0_bit        _BIT_ACCESS(HLT1CON0,3)
// HLT1CON0<H1OUTPS1>
extern volatile __bit                   H1OUTPS1            __at(0x8AC);	// @ (0x115 * 8 + 4)
#define                                 H1OUTPS1_bit        _BIT_ACCESS(HLT1CON0,4)
// HLT1CON0<H1OUTPS2>
extern volatile __bit                   H1OUTPS2            __at(0x8AD);	// @ (0x115 * 8 + 5)
#define                                 H1OUTPS2_bit        _BIT_ACCESS(HLT1CON0,5)
// HLT1CON0<H1OUTPS3>
extern volatile __bit                   H1OUTPS3            __at(0x8AE);	// @ (0x115 * 8 + 6)
#define                                 H1OUTPS3_bit        _BIT_ACCESS(HLT1CON0,6)
// HLT1CON1<H1REREN>
extern volatile __bit                   H1REREN             __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 H1REREN_bit         _BIT_ACCESS(HLT1CON1,0)
// HLT1CON1<H1RES>
extern volatile __bit                   H1RES               __at(0x8B6);	// @ (0x116 * 8 + 6)
#define                                 H1RES_bit           _BIT_ACCESS(HLT1CON1,6)
// HLT2CON0<H2CKPS0>
extern volatile __bit                   H2CKPS0             __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 H2CKPS0_bit         _BIT_ACCESS(HLT2CON0,0)
// HLT2CON0<H2CKPS1>
extern volatile __bit                   H2CKPS1             __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 H2CKPS1_bit         _BIT_ACCESS(HLT2CON0,1)
// HLT2CON1<H2ERS0>
extern volatile __bit                   H2ERS0              __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 H2ERS0_bit          _BIT_ACCESS(HLT2CON1,2)
// HLT2CON1<H2ERS1>
extern volatile __bit                   H2ERS1              __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 H2ERS1_bit          _BIT_ACCESS(HLT2CON1,3)
// HLT2CON1<H2ERS2>
extern volatile __bit                   H2ERS2              __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 H2ERS2_bit          _BIT_ACCESS(HLT2CON1,4)
// HLT2CON1<H2FEREN>
extern volatile __bit                   H2FEREN             __at(0x8D1);	// @ (0x11A * 8 + 1)
#define                                 H2FEREN_bit         _BIT_ACCESS(HLT2CON1,1)
// HLT2CON1<H2FES>
extern volatile __bit                   H2FES               __at(0x8D7);	// @ (0x11A * 8 + 7)
#define                                 H2FES_bit           _BIT_ACCESS(HLT2CON1,7)
// HLT2CON0<H2ON>
extern volatile __bit                   H2ON                __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 H2ON_bit            _BIT_ACCESS(HLT2CON0,2)
// HLT2CON0<H2OUTPS0>
extern volatile __bit                   H2OUTPS0            __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 H2OUTPS0_bit        _BIT_ACCESS(HLT2CON0,3)
// HLT2CON0<H2OUTPS1>
extern volatile __bit                   H2OUTPS1            __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 H2OUTPS1_bit        _BIT_ACCESS(HLT2CON0,4)
// HLT2CON0<H2OUTPS2>
extern volatile __bit                   H2OUTPS2            __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 H2OUTPS2_bit        _BIT_ACCESS(HLT2CON0,5)
// HLT2CON0<H2OUTPS3>
extern volatile __bit                   H2OUTPS3            __at(0x8CE);	// @ (0x119 * 8 + 6)
#define                                 H2OUTPS3_bit        _BIT_ACCESS(HLT2CON0,6)
// HLT2CON1<H2REREN>
extern volatile __bit                   H2REREN             __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 H2REREN_bit         _BIT_ACCESS(HLT2CON1,0)
// HLT2CON1<H2RES>
extern volatile __bit                   H2RES               __at(0x8D6);	// @ (0x11A * 8 + 6)
#define                                 H2RES_bit           _BIT_ACCESS(HLT2CON1,6)
// PIE1<HLTMR1IE>
extern volatile __bit                   HLTMR1IE            __at(0x462);	// @ (0x8C * 8 + 2)
#define                                 HLTMR1IE_bit        _BIT_ACCESS(PIE1,2)
// PIR1<HLTMR1IF>
extern volatile __bit                   HLTMR1IF            __at(0x62);	// @ (0xC * 8 + 2)
#define                                 HLTMR1IF_bit        _BIT_ACCESS(PIR1,2)
// PIE1<HLTMR2IE>
extern volatile __bit                   HLTMR2IE            __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 HLTMR2IE_bit        _BIT_ACCESS(PIE1,3)
// PIR1<HLTMR2IF>
extern volatile __bit                   HLTMR2IF            __at(0x63);	// @ (0xC * 8 + 3)
#define                                 HLTMR2IF_bit        _BIT_ACCESS(PIR1,3)
// OSCCON<HTS>
extern volatile __bit                   HTS                 __at(0x47A);	// @ (0x8F * 8 + 2)
#define                                 HTS_bit             _BIT_ACCESS(OSCCON,2)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x40E);	// @ (0x81 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x45);	// @ (0x8 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x840);	// @ (0x108 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x841);	// @ (0x108 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x842);	// @ (0x108 * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x843);	// @ (0x108 * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x844);	// @ (0x108 * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x845);	// @ (0x108 * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x440);	// @ (0x88 * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x441);	// @ (0x88 * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x442);	// @ (0x88 * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x443);	// @ (0x88 * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x444);	// @ (0x88 * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x445);	// @ (0x88 * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0x48);	// @ (0x9 * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0x49);	// @ (0x9 * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0x4A);	// @ (0x9 * 8 + 2)
#define                                 IOCCF2_bit          _BIT_ACCESS(IOCCF,2)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0x4B);	// @ (0x9 * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0x4C);	// @ (0x9 * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0x4D);	// @ (0x9 * 8 + 5)
#define                                 IOCCF5_bit          _BIT_ACCESS(IOCCF,5)
// IOCCN<IOCCN0>
extern volatile __bit                   IOCCN0              __at(0x848);	// @ (0x109 * 8 + 0)
#define                                 IOCCN0_bit          _BIT_ACCESS(IOCCN,0)
// IOCCN<IOCCN1>
extern volatile __bit                   IOCCN1              __at(0x849);	// @ (0x109 * 8 + 1)
#define                                 IOCCN1_bit          _BIT_ACCESS(IOCCN,1)
// IOCCN<IOCCN2>
extern volatile __bit                   IOCCN2              __at(0x84A);	// @ (0x109 * 8 + 2)
#define                                 IOCCN2_bit          _BIT_ACCESS(IOCCN,2)
// IOCCN<IOCCN3>
extern volatile __bit                   IOCCN3              __at(0x84B);	// @ (0x109 * 8 + 3)
#define                                 IOCCN3_bit          _BIT_ACCESS(IOCCN,3)
// IOCCN<IOCCN4>
extern volatile __bit                   IOCCN4              __at(0x84C);	// @ (0x109 * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0x84D);	// @ (0x109 * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCP<IOCCP0>
extern volatile __bit                   IOCCP0              __at(0x448);	// @ (0x89 * 8 + 0)
#define                                 IOCCP0_bit          _BIT_ACCESS(IOCCP,0)
// IOCCP<IOCCP1>
extern volatile __bit                   IOCCP1              __at(0x449);	// @ (0x89 * 8 + 1)
#define                                 IOCCP1_bit          _BIT_ACCESS(IOCCP,1)
// IOCCP<IOCCP2>
extern volatile __bit                   IOCCP2              __at(0x44A);	// @ (0x89 * 8 + 2)
#define                                 IOCCP2_bit          _BIT_ACCESS(IOCCP,2)
// IOCCP<IOCCP3>
extern volatile __bit                   IOCCP3              __at(0x44B);	// @ (0x89 * 8 + 3)
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0x44C);	// @ (0x89 * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x44D);	// @ (0x89 * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// INTCON<IOCIE>
extern volatile __bit                   IOCIE               __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 IOCIE_bit           _BIT_ACCESS(INTCON,3)
// INTCON<IOCIF>
extern volatile __bit                   IOCIF               __at(0x58);	// @ (0xB * 8 + 0)
#define                                 IOCIF_bit           _BIT_ACCESS(INTCON,0)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x47C);	// @ (0x8F * 8 + 4)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x47D);	// @ (0x8F * 8 + 5)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,5)
// STATUS<IRP>
extern volatile __bit                   IRP                 __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 IRP_bit             _BIT_ACCESS(STATUS,7)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x828);	// @ (0x105 * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x829);	// @ (0x105 * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x82A);	// @ (0x105 * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x82C);	// @ (0x105 * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x82D);	// @ (0x105 * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x838);	// @ (0x107 * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x839);	// @ (0x107 * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x83A);	// @ (0x107 * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x83B);	// @ (0x107 * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x83C);	// @ (0x107 * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x83D);	// @ (0x107 * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// OSCCON<LTS>
extern volatile __bit                   LTS                 __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 LTS_bit             _BIT_ACCESS(OSCCON,1)
// CMOUT<MCOUT1>
extern volatile __bit                   MCOUT1              __at(0x4F8);	// @ (0x9F * 8 + 0)
#define                                 MCOUT1_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MCOUT2>
